Repository: dodog/hass-gshell-extension
Catalog: po/*.po
Languages: sk

source: HASS Events
sk: HASS udalosti

source: Start Home Assistant
sk: Spustiť Home Assistant

source: Stop Home Assistant
sk: Zastaviť Home Assistant

source: Close Home Assistant
sk: Zavrieť Home Assistant

source: Refresh
sk: Obnoviť

source: Preferences
sk: Predvoľby

source: Toggle:
sk: Prepnúť:

source: General Settings
sk: Všeobecné nastavenia

source: Refresh sensors
sk: Obnovovať senzory

source: Panel Icon Options:
sk: Možnosti ikony panela:

source: Togglables
sk: Prepínače

source: Choose which togglables should appear in the menu:
sk: Vyberte, ktoré prepínače sa majú zobraziť v ponuke:

source: No togglable found. Please check your Home-Assistant connection settings.
sk: Nenašiel sa žiadny prepínač. Skontrolujte nastavenia pripojenia Home-Assistant.

source: Sensors
sk: Senzory

source: Choose which sensors should appear on the panel:
sk: Vyberte, ktoré senzory sa majú zobraziť na paneli:

source: No sensor found. Please check your Home-Assistant connection settings.
sk: Nenašiel sa žiadny senzor. Skontrolujte nastavenia pripojenia Home-Assistant.

source: Access Token
sk: Prístupový token

source: Error toggling %s
sk: Chyba pri prepínaní %s

source: Error occured trying to toggle %s: entity not found.
sk: Pri pokuse o prepnutie %s došlo k chybe: entita nebola nájdená.

source: %s toggled on
sk: %s zapnuté

source: %s successfully toggled on.
sk: %s bolo úspešne zapnuté.

source: %s toggled off
sk: %s vypnuté

source: %s successfully toggled off.
sk: %s bolo úspešne vypnuté.

source: %s toggled
sk: %s prepnuté

source: %s successfully toggled.
sk: %s bolo úspešne prepnuté.

source: Error occured trying to toggle %s.
sk: Pri pokuse o prepnutie %s došlo k chybe.

source: Home-Assistant start event triggered
sk: Udalosť spustenia Home-Assistant bola spustená

source: Home-Assistant start event successfully triggered.
sk: Udalosť spustenia Home-Assistant bola úspešne spustená.

source: Home-Assistant stop event triggered
sk: Udalosť zastavenia Home-Assistant bola spustená

source: Home-Assistant stop event successfully triggered.
sk: Udalosť zastavenia Home-Assistant bola úspešne spustená.

source: Home-Assistant close event triggered
sk: Udalosť zatvorenia Home-Assistant bola spustená

source: Home-Assistant close event successfully triggered.
sk: Udalosť zatvorenia Home-Assistant bola úspešne spustená.

source: Home-Assistant event triggered
sk: Udalosť Home-Assistant bola spustená

source: Home-Assistant event successfully triggered.
sk: Udalosť Home-Assistant bola úspešne spustená.

source: Error triggering Home-Assistant start event
sk: Chyba pri spustení udalosti spustenia Home-Assistant

source: Error occured triggering Home-Assistant start event.
sk: Pri spustení udalosti spustenia Home-Assistant došlo k chybe.

source: Error triggering Home-Assistant stop event
sk: Chyba pri spustení udalosti zastavenia Home-Assistant

source: Error occured triggering Home-Assistant stop event.
sk: Pri spustení udalosti zastavenia Home-Assistant došlo k chybe.

source: Error triggering Home-Assistant close event
sk: Chyba pri spustení udalosti zatvorenia Home-Assistant

source: Error occured triggering Home-Assistant close event.
sk: Pri spustení udalosti zatvorenia Home-Assistant došlo k chybe.

source: Error triggering Home-Assistant event
sk: Chyba pri spustení udalosti Home-Assistant

source: Error occured triggering Home-Assistant event.
sk: Pri spustení udalosti Home-Assistant došlo k chybe.

source: Panel Icon.
sk: Ikona panela.

source: The default icon that will be visible in the panel.
sk: Predvolená ikona, ktorá bude viditeľná na paneli.

source: Complete list of valid panel icons for the extension.
sk: Úplný zoznam platných ikon panelu pre rozšírenie.

source: The paths have to be relative to the directory where the 'extension.js' file is located.
sk: Cesty musia byť relatívne k adresáru, v ktorom sa nachádza súbor "extension.js".

source: Refresh Rate
sk: Obnovovacia frekvencia

source: The refresh rate for the weather statistics in seconds (works only if "Refresh Temperature/Humidity Sensors" is enabled).
sk: Frekvencia obnovovania štatistík počasia v sekundách (funguje len vtedy, ak je povolená možnosť „Obnovovať snímače teploty/vlhkosti“).

source: Whether or not you want to refresh the temperature and/or humidity sensor values.
sk: Či chcete alebo nechcete obnovovať hodnoty senzora teploty a/alebo vlhkosti.

source: Show notifications
sk: Zobrazovať oznámenia

source: Show notifications when enable/disable togglables or on HASS events.
sk: Zobraziť oznámenia pri zapnutí/vypnutí prepínačov alebo pri udalostiach HASS.

source: URL
sk: URL adresa

source: The url where your hass instance is hosted.
sk: Adresa url, na ktorej je umiestnená vaša inštalácia hass.

source: Home-Assistant entities's state cache.
sk: Vyrovnávacia pamäť stavu entít Home-Assistant.

source: Home-Assistant entities's state cache. It is meant to be filled automatically on start-up or after pressing the 'Refresh' button in the Preferences menu.
sk: Vyrovnávacia pamäť stavu entít Home-Assistant. Má sa vyplniť automaticky pri spustení alebo po stlačení tlačidla „Obnoviť“ v ponuke Predvoľby.

source: Entity ids for home-assistant switches.
sk: Identifikátory entít pre prepínače Home-assistant.

source: Entity ids for home-assistant switches. E.g. switch.livingroom_lights_relay.
sk: Identifikátory entít pre prepínače Home-assistant. Napr. prepinac.obyvacka_svetlo.

source: Entity ids for home assistant sensors.
sk: Identifikátory entít pre senzory Home Assistant.

source: Entity ids for home-assistant sensors. E.g. sensor.livingroom_temperature.
sk: Identifikátory entít pre senzory Home Assistant. Napr. senzor.obyvacka_teplota.

source: Enable debug mode
sk: Povoliť režim ladenia

source: When this mode is enabled, more logged messages could be seen in the journal.
sk: Keď je tento režim povolený, v protokole sa zobrazí viac zaznamenaných správ.

source: Home Assistant Extension - Shortcut Key
sk: Rozšírenie Home Assistant - klávesová skratka

source: Shortcut key on how to open the extension's menu from the tray.
sk: Klávesová skratka na otvorenie ponuky rozšírenia z panela.
